perf-tests/reports/load-150vu-txfix.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: perf-tests/k6/scenario.js
        output: -

     scenarios: (100.00%) 1 scenario, 150 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 150 looping VUs for 30s (gracefulStop: 30s)

time="2026-08-17T13:50:52+05:30" level=warning msg="Request Failed" error="Post \"http://localhost:8082/api/v1/auth/login\": read tcp 127.0.0.1:57153->127.0.0.1:8082: read: connection reset by peer"
time="2026-08-17T13:50:52+05:30" level=error msg="Error: login failed for op0020@t01.perf.local (0): null\n\tat loginAs (file:///Users/prashantrohidaskamble/Desktop/courier-management/perf-tests/k6/scenario.js:103:15(53))\n\tat default (file:///Users/prashantrohidaskamble/Desktop/courier-management/perf-tests/k6/scenario.js:149:28(9))\n" executor=constant-vus hint="script exception" scenario=default source=stacktrace

running (0m01.0s), 150/150 VUs, 1 complete and 0 interrupted iterations
default   [   2% ] 150 VUs  00.7s/30s

running (0m02.0s), 150/150 VUs, 1 complete and 0 interrupted iterations
default   [   6% ] 150 VUs  01.7s/30s

running (0m03.0s), 150/150 VUs, 1 complete and 0 interrupted iterations
default   [   9% ] 150 VUs  02.7s/30s

running (0m04.0s), 150/150 VUs, 1 complete and 0 interrupted iterations
default   [  12% ] 150 VUs  03.7s/30s

running (0m05.0s), 150/150 VUs, 1 complete and 0 interrupted iterations
default   [  16% ] 150 VUs  04.7s/30s

running (0m06.0s), 150/150 VUs, 1 complete and 0 interrupted iterations
default   [  19% ] 150 VUs  05.7s/30s

running (0m07.0s), 150/150 VUs, 1 complete and 0 interrupted iterations
default   [  22% ] 150 VUs  06.7s/30s

running (0m08.0s), 150/150 VUs, 1 complete and 0 interrupted iterations
default   [  26% ] 150 VUs  07.7s/30s

running (0m09.0s), 150/150 VUs, 1 complete and 0 interrupted iterations
default   [  29% ] 150 VUs  08.7s/30s

running (0m10.0s), 150/150 VUs, 1 complete and 0 interrupted iterations
default   [  32% ] 150 VUs  09.7s/30s

running (0m11.0s), 150/150 VUs, 1 complete and 0 interrupted iterations
default   [  36% ] 150 VUs  10.7s/30s

running (0m12.0s), 150/150 VUs, 1 complete and 0 interrupted iterations
default   [  39% ] 150 VUs  11.7s/30s

running (0m13.0s), 150/150 VUs, 1 complete and 0 interrupted iterations
default   [  42% ] 150 VUs  12.7s/30s

running (0m14.0s), 150/150 VUs, 1 complete and 0 interrupted iterations
default   [  46% ] 150 VUs  13.7s/30s

running (0m15.0s), 150/150 VUs, 1 complete and 0 interrupted iterations
default   [  49% ] 150 VUs  14.7s/30s

running (0m16.0s), 150/150 VUs, 1 complete and 0 interrupted iterations
default   [  52% ] 150 VUs  15.7s/30s

running (0m17.0s), 150/150 VUs, 28 complete and 0 interrupted iterations
default   [  56% ] 150 VUs  16.7s/30s

running (0m18.0s), 150/150 VUs, 54 complete and 0 interrupted iterations
default   [  59% ] 150 VUs  17.7s/30s

running (0m19.0s), 150/150 VUs, 151 complete and 0 interrupted iterations
default   [  62% ] 150 VUs  18.7s/30s

running (0m20.0s), 150/150 VUs, 151 complete and 0 interrupted iterations
default   [  66% ] 150 VUs  19.7s/30s

running (0m21.0s), 150/150 VUs, 151 complete and 0 interrupted iterations
default   [  69% ] 150 VUs  20.7s/30s

running (0m22.0s), 150/150 VUs, 151 complete and 0 interrupted iterations
default   [  72% ] 150 VUs  21.7s/30s

running (0m23.0s), 150/150 VUs, 151 complete and 0 interrupted iterations
default   [  76% ] 150 VUs  22.7s/30s

running (0m24.0s), 150/150 VUs, 151 complete and 0 interrupted iterations
default   [  79% ] 150 VUs  23.7s/30s

running (0m25.0s), 150/150 VUs, 151 complete and 0 interrupted iterations
default   [  82% ] 150 VUs  24.7s/30s

running (0m26.0s), 150/150 VUs, 151 complete and 0 interrupted iterations
default   [  86% ] 150 VUs  25.7s/30s

running (0m27.0s), 150/150 VUs, 154 complete and 0 interrupted iterations
default   [  89% ] 150 VUs  26.7s/30s

running (0m28.0s), 150/150 VUs, 190 complete and 0 interrupted iterations
default   [  92% ] 150 VUs  27.7s/30s

running (0m29.0s), 150/150 VUs, 196 complete and 0 interrupted iterations
default   [  96% ] 150 VUs  28.7s/30s

running (0m30.0s), 150/150 VUs, 231 complete and 0 interrupted iterations
default   [  99% ] 150 VUs  29.7s/30s

running (0m31.0s), 148/150 VUs, 301 complete and 0 interrupted iterations
default ↓ [ 100% ] 150 VUs  30s

running (0m32.0s), 148/150 VUs, 301 complete and 0 interrupted iterations
default ↓ [ 100% ] 150 VUs  30s

running (0m33.0s), 148/150 VUs, 301 complete and 0 interrupted iterations
default ↓ [ 100% ] 150 VUs  30s

running (0m34.0s), 148/150 VUs, 301 complete and 0 interrupted iterations
default ↓ [ 100% ] 150 VUs  30s

running (0m35.0s), 148/150 VUs, 301 complete and 0 interrupted iterations
default ↓ [ 100% ] 150 VUs  30s

running (0m36.0s), 145/150 VUs, 304 complete and 0 interrupted iterations
default ↓ [ 100% ] 150 VUs  30s

running (0m37.0s), 144/150 VUs, 305 complete and 0 interrupted iterations
default ↓ [ 100% ] 150 VUs  30s

running (0m38.0s), 132/150 VUs, 317 complete and 0 interrupted iterations
default ↓ [ 100% ] 150 VUs  30s

running (0m39.0s), 107/150 VUs, 342 complete and 0 interrupted iterations
default ↓ [ 100% ] 150 VUs  30s

running (0m40.0s), 067/150 VUs, 382 complete and 0 interrupted iterations
default ↓ [ 100% ] 150 VUs  30s

running (0m41.0s), 041/150 VUs, 408 complete and 0 interrupted iterations
default ↓ [ 100% ] 150 VUs  30s


  █ THRESHOLDS 

    create_shipment_duration
    ✓ 'p(95)<1000' p(95)=264.2746

    dashboard_duration
    ✗ 'p(95)<1000' p(95)=4897.2689

    http_req_duration
    ✗ 'p(95)<1000' p(95)=4.98s
    ✗ 'p(99)<2000' p(99)=6.33s

    http_req_failed
    ✓ 'rate<0.01' rate=0.03%

    login_duration
    ✗ 'p(95)<1000' p(95)=6935.68905

    search_duration
    ✗ 'p(95)<1000' p(95)=1981.3451


  █ TOTAL RESULTS 

    checks_total.......: 2840   68.912339/s
    checks_succeeded...: 99.96% 2839 out of 2840
    checks_failed......: 0.03%  1 out of 2840

    ✗ login 200
      ↳  99% — ✓ 151 / ✗ 1
    ✓ dashboard 200
    ✓ search 200
    ✓ open shipment 200
    ✓ track 200
    ✓ create shipment 201/200
    ✓ update shipment 200

    CUSTOM
    create_shipment_duration.......: avg=82.082176   min=6.78    med=57.346    max=428.684  p(90)=204.4078  p(95)=264.2746  
    dashboard_duration.............: avg=3899.864799 min=183.249 med=4375.829  max=6192.594 p(90)=4742.3647 p(95)=4897.2689 
    login_duration.................: avg=5728.093211 min=2.148   med=5948.4415 max=7512.568 p(90)=6617.5679 p(95)=6935.68905
    search_duration................: avg=997.31692   min=55.083  med=1030.5835 max=2341.481 p(90)=1806.1804 p(95)=1981.3451 

    HTTP
    http_req_duration..............: avg=1.12s       min=1.64ms  med=78.16ms   max=7.51s    p(90)=4.53s     p(95)=4.98s     
      { expected_response:true }...: avg=1.12s       min=1.64ms  med=78.22ms   max=7.51s    p(90)=4.53s     p(95)=4.98s     
    http_req_failed................: 0.03%  1 out of 2844
    http_reqs......................: 2844   69.009398/s

    EXECUTION
    iteration_duration.............: avg=13.1s       min=3.8ms   med=11.74s    max=18.23s   p(90)=17.88s    p(95)=18.14s    
    iterations.....................: 449    10.894944/s
    vus............................: 41     min=41        max=150
    vus_max........................: 150    min=150       max=150

    NETWORK
    data_received..................: 12 MB  301 kB/s
    data_sent......................: 2.4 MB 59 kB/s



running (0m41.2s), 000/150 VUs, 449 complete and 0 interrupted iterations
default ✓ [ 100% ] 150 VUs  30s
time="2026-08-17T13:51:33+05:30" level=error msg="thresholds on metrics 'dashboard_duration, http_req_duration, login_duration, search_duration' have been crossed"